/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_error_handler.c                                 :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: casubmar <casubmar@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/09/04 13:54:08 by casubmar          #+#    #+#             */
/*   Updated: 2020/09/04 19:16:07 by casubmar         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../includes/cub3d.h"

/*
    1 - Первая строка пустая (Конфиг начинается на пустую строку) 
    2 -  Неверный параметр (пробел<-R || Не та буква)
    3 - Нет такого файла
    4 - Ошибка пола
*/

int        ft_error_handler(t_all *all, t_list *head, int err)
{
    printf("err - %d\n", err);
    return (1);
}